Series

In [2]:
import pandas as pd

#Create a Series in pandas 
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

#Accessing one element from dataframe
s['b']

-5

In [3]:
#--------------------------------------------BOOLIAN INDEXING -----------------------------------------------
#Series S where value is not >1
a1 = s[~(s>1)]
print(a1)
print("-----------------------------------------")
# S where value is <-1 or >2 
a2 = s[(s<-1) | (s>2)]
print(a2)
print("-----------------------------------------")
# Set index a of Series s to 6
s['a'] = 6 
s['a']

b   -5
dtype: int64
-----------------------------------------
a    3
b   -5
c    7
d    4
dtype: int64
-----------------------------------------

6

In [12]:
#Delete or drop any column from serie 
s.drop(['a'])

b   -5
c    7
d    4
dtype: int64

====================================================================================================================================================

Data Frame

In [4]:
#Create two daimentional dataframe using pandas 
data = {   'Country': ['Belgium', 'India', 'Brazil'], 
           'Capital': ['Brussels', 'New Delhi', 'Brasília'],
           'Population': [11190846, 1303171035, 207847528]
       }
    
#Convert dataframe into tabuler format
df = pd.DataFrame(data)

#Get Subset of data element 
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [5]:
#Select single value by raw and column (ByPosition)
df.iloc[[0], [0]]

   Country
0  Belgium

In [6]:
#Select single value by row &column labels (ByLable)
df.loc[[0], ['Country']]

   Country
0  Belgium

In [7]:
#Select single row of subset of rows(By Lable/Position)

a = df.loc[[2]]
b = df.loc[:,'Capital'] 
c = df.loc[1, 'Capital']

print(a)
print("--------------------------------------------")
print(b)
print("--------------------------------------------")
print(c)

  Country   Capital  Population
2  Brazil  Brasília   207847528
--------------------------------------------
0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object
--------------------------------------------
New Delhi

In [8]:
#--------------------------------------------BOOLIAN INDEXING -----------------------------------------------
#Use filter to adjust Dataframe
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [10]:
#-------------------------------------Read and write CSV file---------------------------------------------------- 
df.to_csv("mydataframe.csv")
pd.read_csv("mydataframe.csv")
 #With the use of pandas we can read many types of files like csv ,excel ,etc ..

   Unnamed: 0  Country    Capital  Population
0           0  Belgium   Brussels    11190846
1           1    India  New Delhi  1303171035
2           2   Brazil   Brasília   207847528

In [13]:
#---------------------------------Delete or drop any column from data frame --------------------------------------
df.drop('Country', axis=1)
  #Drop values from columns(axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [17]:
#------------------------------------------------Sort & Rank ----------------------------------------------------
df.sort_index() 
  #Sort by labels along an axis

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [16]:
df.sort_values(by='Country')
  #Sort by the values along an axis

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [18]:
# Assign ranks to entries
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

In [ ]:
#*********************************Retrieving Series/DataFrame Information****************************************

In [31]:
#---------------------------------------Basic Information---------------------------------------------------------
df.shape
  #its return a number of raws and colunms 
df.index
  #give a information about index 
df.columns
  #give a name of colunms in dataframe 
df.info()
  #Give many information of dataframe
df.count()
  #count non-null values in each column of a DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

Country       3
Capital       3
Population    3
dtype: int64

In [36]:
#-----------------------------------------------Summary-----------------------------------------------------
df.sum()
  #its return sum of values in dataframe 
df.cumsum()
  # calculate the cumulative sum of values along a specified axis in a DataFrame or Series

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409